
export const db = [
    {
        name: 'Кино',
        startYear: 1987,
        endYear: 1991,
        events: [
            { year: 1987, text: 'Какой то текст о событиях 1987...' },
            { year: 1988, text: 'Какой то текст о событиях 1988...' },
            { year: 1989, text: 'Какой то текст о событиях 1989...' },
            { year: 1990, text: 'Какой то текст о событиях 1990...' },
            { year: 1991, text: 'Какой то текст о событиях 1991...' },
        ]
    },
    {
        name: 'Литература',
        startYear: 1992,
        endYear: 1997,
        events: [
            { year: 1992, text: 'Какой то текст о событиях 1992...' },
            { year: 1994, text: '"Бессоница" - роман Стивена Кинга' },
            { year: 1995, text: 'Нобелевская премия по литературе - Шеймас Хини' },
            { year: 1997, text: 'Какой то текст о событиях 1997...' },
        ]
    },
    {
        name: 'Спорт',
        startYear: 1998,
        endYear: 2005,
        events: [
            { year: 1998, text: 'Какой то текст о событиях 1998...' },
            { year: 1999, text: 'Какой то текст о событиях 1999...' },
            { year: 2000, text: 'Какой то текст о событиях 2000...' },
            { year: 2003, text: 'Какой то текст о событиях 2003...' },
            { year: 2004, text: 'Какой то текст о событиях 2004...' },
        ]
    },
    {
        name: 'Музыка',
        startYear: 2006,
        endYear: 2009,
        events: [
            { year: 2006, text: 'Какой то текст о событиях 2006...' },
            { year: 2007, text: 'Какой то текст о событиях 2007...' },
            { year: 2008, text: 'Какой то текст о событиях 2008...' },
            { year: 2009, text: 'Какой то текст о событиях 2009...' },
        ]
    },
    {
        name: 'Технологии',
        startYear: 2010,
        endYear: 2015,
        events: [
            { year: 2010, text: 'Какой то текст о событиях 2010...' },
            { year: 2011, text: 'Какой то текст о событиях 2011...' },
            { year: 2012, text: 'Какой то текст о событиях 2012...' },
            { year: 2014, text: 'Какой то текст о событиях 2014...' },
            { year: 2015, text: 'Какой то текст о событиях 2015...' },
        ]
    },
    {
        name: 'Наука',
        startYear: 2015,
        endYear: 2022,
        events: [
            { year: 2015, text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды' },
            { year: 2016, text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11' },
            { year: 2017, text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi' },
            { year: 2018, text: 'Какой то текст о событиях 2018...' },
            { year: 2022, text: 'Какой то текст о событиях 2022...' },
        ]
    },
]